Revit 2024 API
PanelScheduleData.UpdateCircuitTableForTemplate Method
 Redraw the circuit table for a template with the given parameter updates
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void UpdateCircuitTableForTemplate(
	PanelSchedulePhaseLoadType newType,
	int nNumSlots,
	bool bPhasesAsCurrents
)
Visual Basic
Public Sub UpdateCircuitTableForTemplate ( _
	newType As PanelSchedulePhaseLoadType, _
	nNumSlots As Integer, _
	bPhasesAsCurrents As Boolean _
)
Visual C++
public:
void UpdateCircuitTableForTemplate(
	PanelSchedulePhaseLoadType newType,
	int nNumSlots,
	bool bPhasesAsCurrents
)
Parameters
newType
Type: Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType
 The new phase load type of the circuit table
nNumSlots
Type: System.Int32
 The number of circuit slots
bPhasesAsCurrents
Type: System.Boolean
 True if the phase columns should be currents, false if they should be loads
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace